> _Endless_ drift... this is a pretty basic expected behaviour of a terraform provider, when will it be fixed?
> 
> Here's another example
> 
> ```
>   ~ resource "cloudflare_dns_record" "sample" {
>       + comment             = (known after apply)
>       + comment_modified_on = (known after apply)
>       ~ created_on          = "2025-05-04T07:21:18Z" -> (known after apply)
>       + data                = (known after apply)
>         id                  = "abcdef1234"
>       ~ meta                = jsonencode({}) -> (known after apply)
>       ~ modified_on         = "2025-05-04T23:43:17Z" -> (known after apply)
>         name                = "_abcd1234.customer.com"
>       ~ proxiable           = false -> (known after apply)
>       ~ settings            = {
>           + flatten_cname = false
>           + ipv4_only     = (known after apply)
>           + ipv6_only     = (known after apply)
>         }
>         tags                = []
>       + tags_modified_on    = (known after apply)
>         # (5 unchanged attributes hidden)
>     }
> ```
> 
> Off a resource definition that looks like this:
> 
> ```
> resource "cloudflare_dns_record" "sample" {
>   zone_id  =  "abced"
>   content  = "abcdef.com"
>   name     = "_abcd1234.customer.com"
>   proxied  = false
>   settings = {
>     flatten_cname = false
>   }
>   ttl  = 60
>   type = "CNAME"
> }
> ```
> 
> All of the "known after apply" are injected by the provider. Turns plans involving 50+ domains into complete custard.

Experiencing the same - since these are read only values does not feel we are asking for much :) 